# 1) ===========================================================================================
my_list = ["Hi!", 56, False, None, 45.7886]
for i in my_list:
    print(f"{i} - {type(i)}")

# 3) ============================================================================================
# 1 вариант ------------------------------
n = int(input('Введите месяц в виде числа от 1 до 12: '))
my_list = ['Зима', 'Весна', 'Лето', 'Осень']

if (1 <= n) and (n <= 2):
    print('Зима')
elif (3 <= n) and (n <= 5):
    print('Весна')
elif (6 <= n) and (n <= 8):
    print('Лето')
elif (9 <= n) and (n <= 11):
    print('Осень')
else:
    print('Зима')

# 2 вариант --------------------------------
n = int(input('Введите месяц в виде числа от 1 до 12: '))
my_dict = {'Зима': [12, 1, 2], 'Весна': [3, 4, 5],
           'Лето': [6, 7, 8], 'Осень': [9, 10, 11]}

for key, value in my_dict.items():
    if (n in value):
        print(key)

# 4) ============================================================================================
my_list = input("Введите несколько слов через пробел: ")
for i, el in enumerate(my_list.split(), 1):
    print(f"{i}. {el[:10]}")


